# FabricSheetDefaultMinorLapspliceLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricSheetDefaultMinorLapspliceLength Property
ParameterTypeId Class See Also
---
"Default Minor Lap Splice Length": Default Minor Lap Splice Length
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricSheetDefaultMinorLapspliceLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetDefaultMinorLapspliceLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricSheetDefaultMinorLapspliceLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace